{
    "format": "layers-model",
    "generatedBy": "keras v3.10.0",
    "convertedBy": "TensorFlow.js Converter v4.22.0",
    "modelTopology": {
        "keras_version": "3.10.0",
        "backend": "tensorflow",
        "model_config": {
            "class_name": "Sequential",
            "config": {
                "name": "sequential",
                "trainable": true,
                "layers": [
                    {
                        "class_name": "InputLayer",
                        "config": {
                            "batch_input_shape": [null, 28, 28, 1],
                            "dtype": "float32",
                            "sparse": false,
                            "ragged": false,
                            "name": "input_layer"
                        }
                    },
                    {
                        "class_name": "Conv2D",
                        "config": {
                            "name": "conv2d",
                            "trainable": true,
                            "filters": 32,
                            "kernel_size": [3, 3],
                            "strides": [1, 1],
                            "padding": "valid",
                            "activation": "relu",
                            "use_bias": true
                        }
                    },
                    {
                        "class_name": "MaxPooling2D",
                        "config": {
                            "name": "max_pooling2d",
                            "trainable": true,
                            "pool_size": [2, 2],
                            "padding": "valid",
                            "strides": [2, 2]
                        }
                    },
                    {
                        "class_name": "Conv2D",
                        "config": {
                            "name": "conv2d_1",
                            "trainable": true,
                            "filters": 64,
                            "kernel_size": [3, 3],
                            "strides": [1, 1],
                            "padding": "valid",
                            "activation": "relu",
                            "use_bias": true
                        }
                    },
                    {
                        "class_name": "MaxPooling2D",
                        "config": {
                            "name": "max_pooling2d_1",
                            "trainable": true,
                            "pool_size": [2, 2],
                            "padding": "valid",
                            "strides": [2, 2]
                        }
                    },
                    {
                        "class_name": "Flatten",
                        "config": {
                            "name": "flatten",
                            "trainable": true
                        }
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "name": "dense",
                            "trainable": true,
                            "units": 128,
                            "activation": "relu",
                            "use_bias": true
                        }
                    },
                    {
                        "class_name": "Dropout",
                        "config": {
                            "name": "dropout",
                            "trainable": true,
                            "rate": 0.5
                        }
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "name": "dense_1",
                            "trainable": true,
                            "units": 5,
                            "activation": "softmax",
                            "use_bias": true
                        }
                    }
                ],
                "build_input_shape": [null, 28, 28, 1]
            }
        }
    },
    "weightsManifest": [
        {
            "paths": ["group1-shard1of1.bin"],
            "weights": [
                { "name": "conv2d/kernel", "shape": [3, 3, 1, 32], "dtype": "float32" },
                { "name": "conv2d/bias", "shape": [32], "dtype": "float32" },
                { "name": "conv2d_1/kernel", "shape": [3, 3, 32, 64], "dtype": "float32" },
                { "name": "conv2d_1/bias", "shape": [64], "dtype": "float32" },
                { "name": "dense/kernel", "shape": [1600, 128], "dtype": "float32" },
                { "name": "dense/bias", "shape": [128], "dtype": "float32" },
                { "name": "dense_1/kernel", "shape": [128, 5], "dtype": "float32" },
                { "name": "dense_1/bias", "shape": [5], "dtype": "float32" }
            ]
        }
    ]
}